OpenFOAMfiles/run/streetcanyon_perpendicular/LoD2/LAD02/conifer/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    x0
    {
        type            symmetry;
        inGroups        List<word> 1(symmetry);
        nFaces          481;
        startFace       25986;
    }
    y0
    {
        type            patch;
        nFaces          247;
        startFace       26467;
    }
    x1
    {
        type            symmetry;
        inGroups        List<word> 1(symmetry);
        nFaces          481;
        startFace       26714;
    }
    y1
    {
        type            patch;
        nFaces          247;
        startFace       27195;
    }
    terrain
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          703;
        startFace       27442;
    }
    sky
    {
        type            symmetry;
        inGroups        List<word> 1(symmetry);
        nFaces          703;
        startFace       28145;
    }
)

// ************************************************************************* //
